Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Seven Years Later.tmx
Source language: en
Languages: es_419

source: You know, what I went through yesterday...
es_419: Todo lo que pasé ayer,

source: Yes, they finally managed to get the airplane tickets.
es_419: Sí, por fin pudieron conseguir los boletos de avión.

source: look, we had planned for this trip for months...
es_419: Llevamos meses planeando este viaje…

source: ...that I was the one who saved him in that fire.
es_419: … que fui yo quien lo salvó de ese incendio.

source: ...or let yourself be locked up inside this cage forever.
es_419: o quédate encerrada en esta jaula para siempre.

source: but he chose to keep quiet.
es_419: Pero prefirió no decir nada.

source: but who would have thought that I would meet the person who'd gone missing for seven years?
es_419: ¿Pero quién iba a pensar que me encontraría con la persona que desapareció hace siete años?

source: and if you disappear again, I'll just put the blame on the guy standing next to you right now.
es_419: Y si vuelves a desaparecer, solo le tengo que echar la culpa al tipo que está a tu lado y listo.

source: Yeah, I'm sure she misses you a lot.
es_419: Sí, seguro ella también te extraña mucho.

source: my meeting WiTH ezra...
es_419: Mi encuentro con Ezra…

source: where did she go?
es_419: ¿A dónde se fue?

source: Hey, seven years ago, I watched a K-drama about an alien coming to the Earth...
es_419: Ey, hace siete años veía una de un alienígena que venía a la Tierra…

source: Ah, sure...
es_419: Ah, por supuesto.

source: she just left like that.
es_419: Se fue así, sin más.

source: ...But to me, home is a prison made with a golden cage. and I'm the prisoner.
es_419: Pero para mí, tener un hogar es una prisión, una jaula dorada, donde yo soy una prisionera.

source: A QNA WITH MY SOON-TO-BE HUSBAND?!
es_419: ¡¿Preguntas y respuestas con mi futuro esposo?!

source: They'll tag along too!
es_419: ¡Ellos también van!

source: so you must be dehydrated.
es_419: Debes estar deshidratada.

source: HAHA HAHA
es_419: Ja, ja, ja.

source: Why do you risk yourself?
es_419: ¿Por qué se arriesgan tanto?

source: oh, thanks so much, Mom!
es_419: ¡Ay! ¡Muchas gracias, ma!

source: a friend from high school? she looked like a teenage girl.
es_419: ¿De la escuela? Se veía muy joven, como una adolescente.

source: There's two weeks until 2014 (now it's December 2013).
es_419: Faltan dos semanas para el 2014 (ahora estamos en diciembre del 2013).

source: I can even see a few strands of her hair have gone gray.
es_419: También puedo ver que ya tiene canas en el pelo.

source: umm..
es_419: Mmm…

source: I did hear his voice...
es_419: Puedo oír su voz.

source: But I need to pack my things first.
es_419: Primero tengo que empacar mis cosas.

source: LAST TIME
es_419: LA ÚLTIMA VEZ

source: You type "www" dot, then "yahoo" followed by dot "com."
es_419: Tipea "www" y un punto. Luego "yahoo" seguido de un punto, y "com".

source: My classmates are planning to go to Bali to celebrate New Year's Eve.
es_419: Mis compañeros están planeando irse a Bali para celebrar Año Nuevo.

source: what is it, dear?
es_419: ¿Qué pasa, mi niña?

source: who?
es_419: ¿Quién?

source: go find ezra!!!
es_419: ¡Ve a buscar a Ezra!

source: Come sit here, Kala.
es_419: Siéntate aquí, Kala.

source: I guess it has water damage.
es_419: Supongo que se dañó por el agua.

source: I just held her hand...
es_419: Solo le tomé la mano…

source: umm, what is this place?
es_419: Mmm, ¿qué es este lugar?

source: She's just hugging me and calling my name...
es_419: No deja de abrazarme y decir mi nombre.

source: ...I'd like to thank you very much for your help...
es_419: Le quiero dar las gracias por ayudarme.

source: And 99 for chemistry.
es_419: Y 99 en química.

source: She said you went to the bathroom, but she couldn’t find you there.
es_419: Dijo que habías ido al baño, pero no te encontró ahí.

source: it means I've missed many things, including...
es_419: Eso significa que me perdí muchas cosas como…

source: I didn't know then that the knowledge would later be used when I'm writing stories.
es_419: No sabía en ese entonces que esos conocimientos me servirían más tarde para escribir historias.

source: besides, our relationship was hanging by a thread.
es_419: Además, ya teníamos problemas en la relación.

source: ara, I'm so happy right now!
es_419: ¡Ara, estoy muy feliz!

source: do you have to hug me like this?!
es_419: ¡¿Y me tienes que abrazar así?!

source: I met my grandma...
es_419: Vi a mi abuela.

source: But I just don’t like it!
es_419: ¡Pero no me gusta!

source: I'll have a cup of coffee.
es_419: Yo quiero una taza de café.

source: um, I think it's best that you don't bring up college to her.
es_419: Mmm, creo que es mejor que no hables de eso con ella.

source: a week?!
es_419: ¡¿Una semana?!

source: Read 9:00 PM
es_419: Leído 9:00 p. m.

source: those stray cats didn't seduce you, right?
es_419: Esos gatos callejeros no te sedujeron, ¿no?

source: but gavin showed me his bracelet. so it means he's not seeing another girl, right?
es_419: Pero me mostró el suyo. Eso quiere decir que no se está viendo con otra chica, ¿no?

source: anyway, the good thing is,
es_419: Sea como sea, me encanta

source: 529, 821, 200 second...
es_419: 529 821 200 segundos…

source: Kinda...
es_419: Un poco.

source: Everyone went to watch Prozen that day...
es_419: Todos fueron a ver Prozen ese día…

source: I need an explanation right now.
es_419: Exijo una explicación ya mismo.

source: Hold onto the board!
es_419: Sujétate a la tabla.

source: Anyway, I need to thank her too.
es_419: De todos modos, yo también tengo que darle las gracias.

source: You know, I didn't believe it when I heard you showed up.
es_419: No podía creerlo cuando me enteré de que habías aparecido, ¿sabes?

source: they labeled me as a "failure."
es_419: Dicen que soy una "fracasada".

source: CALL
es_419: LLAMAR

source: it's getting harder to breathe...
es_419: Me está costando respirar…

source: MY REVIEW ON LIPSTICK FROM BRAND A
es_419: MI OPINIÓN SOBRE EL LÁPIZ LABIAL MARCA A

source: she went missing for seven years...
es_419: Estuvo perdida por siete años…

source: You are right here!
es_419: ¡Y ahora estás aquí!

source: it was just yesterday.
es_419: Fue justo ayer…

source: I gotta go too...
es_419: Yo también voy.

source: I've walked too far away from them!
es_419: ¡Me alejé mucho de ellas!

source: the question is, why was grandma there?
es_419: Ahora necesito saber por qué la abuela estaba ahí.

source: SWISH
es_419: SUISH

source: ...you said she was more important than your own girlfriend.
es_419: … dijiste que ella era más importante que yo.

source: Look at Ezra!
es_419: ¡Mira a Ezra!

source: Nope, just gone a little crazy, I guess
es_419: Nop. Solo está un poco loca supongo.

source: ...don't tell anyone about this!
es_419: … ¡No le cuentes esto a nadie!

source: Hehe
es_419: Jeje

source: my last conversation with lenca ended with her sending a text, saying that she wanted to take a break.
es_419: Mi última conversación con Lenca terminó con un mensaje pidiéndome un tiempo.

source: Hello
es_419: Hola.

source: since forever!
es_419: ¡Desde siempre!

source: Why the long face?
es_419: ¿Por qué la cara larga?

source: I've finished high school, so no more inspections.
es_419: Ya no voy a la escuela, así que no más inspecciones.

source: GRAP
es_419: TOMA

source: but somehow, she was so young, as if she were in her 20s.
es_419: Pero era mucho más joven, como si tuviera unos 20 años.

source: haha...
es_419: Ja, ja…

source: I've been through a long journey with time.
es_419: Viví muchas cosas en este tiempo.

source: ...When he returned from indonesia...
es_419: … cuando volvió de Indonesia…

source: may I, ma'am?
es_419: ¿Puedo, señora?

source: his answer is always the same.
es_419: Pero su respuesta era siempre la misma.

source: I was worried that she'd disappear again, but turns out he hasn't told her yet.
es_419: Me preocupaba que desapareciera de nuevo, pero parece que aún no se lo ha dicho.

source: You'll stay in Bandung with your family,
es_419: ¡Te vas a quedar en Bandung con tu familia

source: I was alive?
es_419: estaba viva?

source: after that, I kept asking him.
es_419: Yo le seguí preguntando.

source: Um, sorry...
es_419: Oh, perdón…

source: I told mom everything...
es_419: Le conté todo a mamá…

source: Just forget it.
es_419: Olvídalo.

source: Don't call* me!
es_419: ¡No me llamen*!

source: I remembered how worried and anxious Ms. Maharani and Mr. Teddy were.
es_419: Me acuerdo de lo preocupados y nerviosos que estaban la Sra. Maharani y el Sr. Teddy.

source: Then how about taking a walk before you go home?
es_419: ¿Qué tal si damos un paseo antes de que te vayas a casa?

source: I still can't believe we're having dinner together...
es_419: Todavía no puedo creer que estemos cenando juntas…

source: GET UP
es_419: SE LEVANTA

source: why is your hair gray?
es_419: ¿Por qué tienes canas?

source: got it. anyway, thanks for taking kala.
es_419: Está bien. Gracias por traer a Kala.

source: ...but I didn't.
es_419: … pero no fue así.

source: Want me to take a picture for you?
es_419: ¿Quieres que te tome una foto?

source: the fire got so big there.
es_419: El fuego se volvió muy fuerte en ese lado.

source: please, please, please!
es_419: ¡Porfis! ¡Porfis! ¡Porfis!

source: I was a bit surprised...
es_419: Me sorprendió bastante…

source: They said their daughter ran away from home.
es_419: Dijeron que su hija se había escapado de casa.

source: is that G-A-V-i-N?
es_419: ¿Ese es G-A-V-I-N?

source: I won't go!
es_419: ¡No voy!

source: Let's go!
es_419: ¡Vamos!

source: I didn't know if Ezra used to come here on Eid fitr..
es_419: No sabía que Ezra venía para la Fiesta del Fin del Ayuno…

source: you can ride a motorbike?!
es_419: ¡¿Puedes andar en moto?!

source: ah, right...
es_419: Ah, cierto…

source: the seniors mocked you because you were dreaming of becoming an astronaut.
es_419: los mayores se burlaban de ti porque soñabas con ser astronauta.

source: Are you still up?
es_419: ¿Sigues despierta?

source: Who still uses a BB?
es_419: ¿Quién usa todavía un BB?

source: ...About how he got that bracelet...
es_419: de dónde sacó ese brazalete.

source: She's from the UK and currently studying in Australia.
es_419: Es de Reino Unido, pero ahora estudia en Australia.

source: Don't cry.
es_419: No llores.

source: It's nothing...
es_419: no es nada…

source: You got my hopes up for nothing!!!
es_419: ¡Me hiciste ilusionar para nada!

source: they wondered, why you left "your girlfriend" alone!
es_419: ¡Querían saber por qué dejaste sola a "tu novia"!

source: *a person who plays mobile MOBA games doesn't want to be bothered with a phone call.
es_419: *Las personas que juegan MOBA en el celular no quieren que les interrumpan con llamadas.

source: ...but to them, it had been...
es_419: Pero para ellos han pasado…

source: but you're the same.
es_419: Pero tú estás igual.

source: is she coming?!
es_419: ¿Ella también viene?

source: Why the fuss...
es_419: ¿Por qué tanto alboroto?

source: and Then I...
es_419: Y de repente…

source: What should I reply to him?!
es_419: ¡¿Qué le respondo?!

source: Why didn't he told me?
es_419: ¿Por qué no me lo dijo?

source: You do???
es_419: ¿¿En serio??

source: Well, do you believe me now?
es_419: Bueno, ¿me crees ahora?

source: Don't be upset.
es_419: No te enojes.

source: just text me once you're done. but don't call me.
es_419: Envíen un mensaje cuando terminen. No me llamen.

source: I wonder what they're doing.
es_419: Quiero saber qué están haciendo.

source: oh, that's it?
es_419: Ah, ¿eso es todo?

source: "you'll be the doctor, and I'll be the pharmacist. so let's start a clinic togeteher!"
es_419: "Tú serás doctora y yo farmacéutica. ¡Y abriremos una clínica!"

source: what the heck was he thinking?
es_419: ¿Qué diablos se le cruzó por la cabeza?

source: Ingrid Gayatri 642K views 2 days ago
es_419: Ingrid Gayatri 642K vistas Hace 2 días

source: yeah, anything you want.
es_419: Sí, lo que quieras.

source: Umm, Ezra...
es_419: Emm, Ezra…

source: What's the last thing you remember?
es_419: ¿Qué es lo último que recuerdas?

source: ...I miss you.
es_419: … te extraño.

source: he said, "it's too dangerous. you'd better drive a car."
es_419: Me decía, "es muy peligroso. Mejor aprende a conducir un auto".

source: alright, welcome back! ingrid gayatri's here!
es_419: ¡Hola de nuevo! ¡Aquí Ingrid Gayatri!

source: she already left, right?
es_419: Ya se fue, ¿no?

source: Today... is December 31, 2013, isn't it?
es_419: Hoy es… 31 de diciembre del 2013, ¿no?

source: BETRAYED
es_419: TRAICIÓN

source: BANDUNG NEW YEAR 2021
es_419: BANDUNG AÑO NUEVO, 2021

source: yeah, he's still there.
es_419: Sí, sigue allí.

source: I remember back then, at school orientation,
es_419: Me acuerdo que, en la clase de orientación,

source: ...I didn't tell her that I saw the younger version of grandma in the fire.
es_419: … no le dije que había visto a la abuela de joven en el incendio.

source: You promised to watch the fireworks together, turns out you bailed on me for some other girl?
es_419: Me prometiste que veríamos los fuegos artificiales juntos. ¿Y te fuiste con otra chica?

source: Ara, you'd better go with her.
es_419: Ara, será mejor que vayas con ella.

source: h-hello...
es_419: H-Hola…

source: two years after you went missing.
es_419: dos años después de tu desaparición.

source: kala's expression is different from yesterday.
es_419: La mirada de Kala es diferente a la de ayer.

source: Ara is his ultimate weapon.
es_419: Ara es su mejor arma.

source: why do you use candle number 4?
es_419: ¿Por qué la vela tiene el número 4?

source: Am I at the bottom of the sea?
es_419: ¿Estoy en el fondo del mar?

source: what do you wish to change anyway?
es_419: Sea como sea, ¿qué quieres cambiar?

source: it still feels like a dream...
es_419: Parece un sueño…

source: I saw he wore a bracelet similar to ours.
es_419: Vi que tenía uno igual al nuestro.

source: Your phone is so big!!!
es_419: ¡¡Tu teléfono es enorme!!

source: and you helped me out.
es_419: Y tú me ayudaste.

source: time?
es_419: ¿El tiempo?

source: I tried to keep calm and postive.
es_419: Traté de calmarme y ser positiva.

source: It's because you were born on February 29!
es_419: ¡Porque naciste un 29 de febrero!

source: what bracelet?
es_419: ¿Qué brazalete?

source: I don't think it'll work even if we charge it.
es_419: No creo que funcione aunque lo carguemos.

source: And they'll shoot 20,001 fireworks.
es_419: Y van a lanzar 20 001 fuegos artificiales.

source: ...I ran from my dad, who came to Bali.
es_419: … huí de mi papá, que vino hasta Bali.

source: Right, goodnight, Grandma!
es_419: Bueno. ¡Buenas noches, abuela!

source: it feels as if I was jumping for joy,
es_419: Sentí que pasé de saltar de alegría,

source: A PROMISE
es_419: UNA PROMESA

source: (ara is now also 17 years old.)
es_419: (Ahora Ara tiene 17 también)

source: I remember ezra Ezra...
es_419: Me acuerdo de Ezra

source: I was planning to watch k-dramas.
es_419: Estaba pensando en mirar series.

source: if you want to go back, you need to focus on the person you were just with.
es_419: Si quieres volver, tienes que concentrarte en la persona que estaba contigo.

source: I used to dream of being an astronaut, but everything fell apart when I developed myopia.
es_419: Soñaba con ser astronauta, pero todo se vino abajo cuando empecé a tener miopía.

source: ...and he hit me...
es_419: … y me golpeó.

source: I know she would speak for me no matter what.
es_419: Sé que ella me defendería a toda costa.

source: We were worried to death because of you!
es_419: ¡Estábamos muy preocupados por ti!

source: it's kinda ball shaped chewy things.
es_419: Son algo así como bolitas masticables.

source: I thought I was going to die in the fire.
es_419: Creí que iba a morir quemado.

source: CHAPTER 12:
es_419: CAPÍTULO 12:

source: I'm with the police.
es_419: Soy de la policía.

source: that I forgot he now has a girlfriend...
es_419: que me olvidé que tiene novia…

source: let's go.
es_419: Vamos.

source: Nope.
es_419: Nop.

source: ugh!
es_419: ¡Agh!

source: DOWN THE RABBIT HOLE
es_419: POR EL AGUJERO DE GUSANO

source: so...
es_419: Pero…

source: Teach her until she understands.
es_419: Enséñale hasta que entienda todo.

source: Thanks.
es_419: Gracias.

source: I don't wanna be a burden to her parents.
es_419: No quiero ser una carga para sus padres.

source: let's go, kala!
es_419: ¡Vamos, Kala!

source: along with ingrid.
es_419: con Ingrid.

source: ...or we tell Mr. Agung that we'll take a walk.
es_419: o le decimos al Sr. Agung que vamos a dar una vuelta.

source: Why the fuss? we're dating, after all.
es_419: ¿Por qué tanto lío? Somos novios.

source: Forget it.
es_419: Olvídalo.

source: how many times do you have to rest?
es_419: ¿Tantas veces tienes que descansar?

source: Why am I here?
es_419: ¿Por qué estoy aquí?

source: if we don't sort this out...
es_419: Si no solucionamos esto…

source: yeah, I'm okay.
es_419: Sí, estoy bien.

source: I'm counting each day, second by second, waiting to be free from this. prison.
es_419: Cuento los días, segundo a segundo, esperando que me liberen de aquí.

source: realizing it was gavin, ara chose to stay in her room.
es_419: Ara decidió quedarse en su pieza cuando vio que era Gavin.

source: actually, I'm afraid to ask you about this.
es_419: Verás, me da un poco de miedo preguntarte esto.

source: but for me it's just two weeks ago.
es_419: Pero para mí fueron tan solo dos semanas.

source: Are you okay, Kala?
es_419: ¿Estás bien, Kala?

source: dang, I'm so exhausted.
es_419: Qué cansado estoy.

source: it's as if it's saying...
es_419: Es como si dijera…

source: BOOHOO
es_419: BUAAAA

source: detective agung and kala's dad has left us behind!
es_419: ¡El detective Agung y el papá de Kala ya se adelantaron!

source: You collapsed last night. it seems you had a panic attack.
es_419: Anoche te desmayaste. Parece que tuviste un ataque de pánico.

source: ...that Ezra, Gavin, and I have the same bracelets?!
es_419: … ¡¿Ezra, Gavin y yo tenemos las mismas pulseras?!

source: please...
es_419: Oye…

source: I thought it wasn't a big problem...
es_419: Creí que no sería un gran problema.

source: all of sudden, her dad showed up and slapped her face.
es_419: De la nada, él apareció en la playa y le dio una bofetada.

source: kala, have you seen kala?
es_419: Kala, ¿has visto a Kala?

source: I'm worried that my dad won't believe our explanation.
es_419: Me preocupa que mi papá no crea nuestra explicación.

source: Go sleep.
es_419: Duerme ya.

source: am I in 2003?!
es_419: ¿Estoy en el 2003?

source: Why can't you be like him?!
es_419: ¿Por qué no puedes ser como él?

source: They can connect to the internet, make phone and video calls, and play games,
es_419: Podemos conectarnos a internet, hacer llamadas y videollamadas y jugar jueguitos.

source: Well, actually, I don't want to ask about this since you didn't get wet at all.
es_419: Bueno, en realidad, tampoco quiero preguntar mucho, ya que ni siquiera estabas mojada.

source: ...but everything seems to be easier now that I know where to go.
es_419: Pero todo se ve más fácil ahora que sé a dónde ir.

source: Sorry, Ingrid.
es_419: Perdón, Ingrid.

source: CHAPTER 10:
es_419: CAPÍTULO 10:

source: okay. her name is kala. she's a friend from high school.
es_419: Bueno. Se llama Kala y es una amiga de la escuela.

source: THE DATE
es_419: LA CITA

source: the reason I didn't want to go to Bali was...
es_419: La razón por la que no quería venir a Bali…

source: I was upset... and angry...
es_419: Estaba triste… Y enojada.

source: I thought his flight is delayed.
es_419: Pensé que habían retrasado su vuelo.

source: You never took me on vacation with our family!
es_419: ¡Tú nunca nos llevaste de vacaciones en familia!

source: Don't just play around!
es_419: ¡No todo puede ser diversión!

source: You shut up!
es_419: ¡Tú cierra el pico!

source: I don't know...
es_419: No sé…

source: I'm full now!
es_419: ¡Ya estoy llena!

source: "Whatever choice you make, it comes with a consequence."
es_419: "Sea cual sea la decisión que tomes, habrá consecuencias".

source: why do you risk yourself?
es_419: ¿Por qué se arriesgan tanto?

source: can't swim!
es_419: sé nadar.

source: Let's meet up with Ingrid tomorrow.
es_419: Vamos a vernos con Ingrid mañana.

source: let's go home.
es_419: Vamos a casa.

source: We are, but there are boundaries!
es_419: ¡Sí, pero hay límites!

source: okay, then...
es_419: Bueno, ahora

source: don't think about things that will make you down.
es_419: No pienses en cosas que te desanimen.

source: Oh right, I have an appointment with my friends from abroad, ma'am.
es_419: Ah, sí. Tengo que encontrarme con mis amigos del extranjero, señora.

source: until I'm ready?
es_419: hasta que esté lista.

source: 2 Message
es_419: 2 mensajes

source: But I do remember this.
es_419: Lo que recuerdo es que,

source: I was scared before...
es_419: Antes tenía mucho miedo.

source: ...but you must change the cat's name.
es_419: … pero tienes que cambiarle el nombre al gato.

source: if it hadn't been for you and gavin, I would've been summoned to the counselor's office.
es_419: Si no hubiera sido por ustedes, el consejero me habría citado en su oficina.

source: it's general knowledge, by the way.
es_419: Pero si todo el mundo sabe eso.

source: Yeah, why do you ask anyway?
es_419: Sí, por qué preguntas?

source: Pack your things now.
es_419: Empaca tus cosas. Ahora.

source: even so, Whatever it is I have to face it, right?
es_419: Sea como sea, tengo que aceptarlo, ¿no?

source: that we talked about opening a clinic together once we grow up.
es_419: … que hablamos de abrir una clínica juntas cuando creciéramos.

source: then I'm not going.
es_419: Entonces no voy.

source: your hair is long!
es_419: ¡Tienes el pelo largo!

source: How do you know my grandma's name?
es_419: ¿Cómo sabes el nombre de mi abuela?

source: what's so funny?
es_419: ¿De qué te ríes?

source: And she would ask about how to use its camera feature, how to upload photos, how to screenshot, and everything.
es_419: Me pregunta cómo usar la cámara, subir fotos, hacer capturas de pantalla y cosas por el estilo.

source: then, I promise you we'll go to places you've never been to before.
es_419: Entonces te prometo que iremos a lugares que nunca hayas visto.

source: in the 531,345,600th second of my life...
es_419: A los 531 345 600 segundos de mi vida…

source: Nowadays, we get to choose a dozen of phone models.
es_419: Ahora podemos elegir un montón de modelos de teléfonos.

source: because neither of us is willing to compromise...
es_419: porque ninguno de los dos se quiere comprometer…

source: because you know the counselor would never check the boys' bags.
es_419: Ya sabías que el consejero nunca revisaba los bolsos de los chicos.

source: like, free all day?
es_419: ¿Estás libre todo el día?

source: I want to be free like the others!
es_419: ¡Quiero ser libre como los demás!

source: I told him about everything I went through...
es_419: Le conté todo lo que pasé.

source: Ah, I forgot to ask him...
es_419: Ay, me olvidé de preguntarle

source: thank you...
es_419: Gracias.

source: You didn't change at all...
es_419: No cambiaste en absoluto.

source: let me go!
es_419: ¡Suéltame!

source: ...I chose to free myself...
es_419: elegí ser libre…

source: Why are you here?
es_419: ¿Qué haces aquí?

source: it's fun, of course!
es_419: ¡Claro! ¡Es divertido!

source: I thought the same thing.
es_419: Yo pensé lo mismo.

source: my sister should be 24 years old now.
es_419: Mi hermana debería tener 24 años ahora.
